# Document Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionsServiceData..::..Document Property
StructuralSectionsServiceData Class See Also
---
The current document.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public Document Document { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Document As Document
	Get
```

Visual C++
---
```text
public:
property Document^ Document {
	Document^ get ();
}
```

# See Also
StructuralSectionsServiceData Class
Autodesk.Revit.DB.Structure Namespace